load-tests/results/high-traffic-p95fix-warmcheck-cold-500x500/k6-console.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /work/load-tests/k6/high-traffic-500vu-10000.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 10m30s max duration (incl. graceful stop):
              * high_traffic_booking: 500 iterations shared among 500 VUs (maxDuration: 10m0s, gracefulStop: 30s)


Run                    [ 100% ] setup()
high_traffic_booking   [   0% ]

running (00m01.9s), 500/500 VUs, 0 complete and 0 interrupted iterations
high_traffic_booking   [   0% ] 500 VUs  00m00.0s/10m0s  000/500 shared iters


  █ TOTAL RESULTS 

    checks_total.......: 1000    416.173056/s
    checks_succeeded...: 100.00% 1000 out of 1000
    checks_failed......: 0.00%   0 out of 1000

    ✓ reservation response has an id
    ✓ reservation response is pending

    CUSTOM
    cancellations_succeeded............: 0      0/s
    errors_idempotency_in_progress.....: 0      0/s
    errors_rate_limited................: 0      0/s
    errors_sold_out....................: 0      0/s
    errors_user_limit..................: 0      0/s
    reservation_server_faults..........: 0      0/s
    reservation_unexpected_responses...: 0      0/s
    reservations_accepted..............: 500    208.086528/s
    reservations_created...............: 500    208.086528/s
    reservations_replayed..............: 0      0/s
    reserve_latency....................: avg=340.01ms min=235.59ms med=333.67ms p(90)=377.09ms p(95)=415.67ms p(99)=429.06ms max=441.24ms

    HTTP
    http_req_duration..................: avg=341.7ms  min=206.49ms med=333.83ms p(90)=377.55ms p(95)=415.73ms p(99)=430.99ms max=901.38ms
      { expected_response:true }.......: avg=341.7ms  min=206.49ms med=333.83ms p(90)=377.55ms p(95)=415.73ms p(99)=430.99ms max=901.38ms
    http_req_failed....................: 0.00%  0 out of 503
    http_reqs..........................: 503    209.335047/s

    EXECUTION
    iteration_duration.................: avg=360.31ms min=236.9ms  med=361.6ms  p(90)=413.94ms p(95)=428.68ms p(99)=468.99ms max=505.56ms
    iterations.........................: 500    208.086528/s
    vus................................: 500    min=0        max=500
    vus_max............................: 500    min=500      max=500

    NETWORK
    data_received......................: 386 kB 161 kB/s
    data_sent..........................: 294 kB 122 kB/s



running (00m02.4s), 000/500 VUs, 500 complete and 0 interrupted iterations
high_traffic_booking ✓ [ 100% ] 500 VUs  00m00.5s/10m0s  500/500 shared iters